sunyongzhen/CHULIAN_GIT/GD32F30x_Demo_Suites_V2.4.3_release/GD32307C_EVAL_Demo_Suites/Project/25_CHULIAN_0312/Projects/FreeRTOS_tcpudp/src/app_rs485net.c
#include "lwip/opt.h"
#include "lwip/tcp.h"
#include "lwip/sys.h"
#include "gd32f30x.h"
#include "gd32f307c_eval.h"
#include "lwip/api.h"
#include "protocol_modbus.h"
#include "protocol_usart.h"
#include "app_rs485net.h"
#include "module_display.h"
#include "app_configure.h"
#include "app_format.h"
#include "module_audio.h"
#include "module_led.h"
#include "module_key.h"
#include "module_adc.h"
#include <string.h>

#define RS485NET_TASK_PRIO  ( tskIDLE_PRIORITY + 5 )

extern struct eeprom_data *p_configuration_data;

struct rs485net_timing_t
{
    uint32_t bus;
    uint16_t frequency;
    uint16_t address;
} deviceList[4];

#if 0
void scan_dev(uint32_t usart_periph)
{
    unsigned char dev = 0;
    unsigned char rdata[8] = {0};
    int retry = 0;

    for (dev = 0; dev < 0xff; dev++)
    {
        while (usart_send(usart_periph, (uint8_t *)packed_modbus_rtu_frame(dev, 0x03, 0x0000, 0x0001), 8) < 0)
        {
            retry++;
            if (retry > 100)
            {
                retry = 0;
//                printf("usart_send retry over 100 times \r\n");
                break;
            }
        }
        while (usart_recv_pre(usart_periph, 7) < 0)
        {
            retry++;
            if (retry > 100)
            {
                retry = 0;
//                printf("usart_recv_pre retry over 100 times \r\n");
                break;
            }
        }
        while (usart_recv(usart_periph, rdata) < 0)
        {
            retry++;
            if (retry > 100)
            {
                retry = 0;
//                printf("usart_recv retry over 100 times \r\n");
                break;
            }
        }
    }
}
#endif

int led_status = 0;
int audio_num = 0;

void cancel_alarm()
{	
	led_status &= 0xdf;
	led_process_cmd(0, &led_status, 1);
	audio_process_cmd(0, 0, 0);
	audio_process_cmd(5, 0, 0);
}

void alarm_action(uint8_t n)
{
	//报警灯
	led_status |= 0x30;
//	printf("led status %d\r\n", led_status);
	led_process_cmd(0, &led_status, 1);
	 vTaskDelay(pdMS_TO_TICKS(300));
	//蜂鸣器
	audio_process_cmd(4, 0, 0);
	//语音播放
	set_num(n);  //动火离人预警
	audio_process_cmd(1, 0, 0);
}

void set_alarm_data()
{
	alarmdata_report.data_type = 1;
	alarmdata_report.alarm_type.time_stamp = rtc_counter_get();
	alarmdata_report.alarm_param.time_stamp = alarmdata_report.alarm_type.time_stamp;
}

void set_warn_data()
{
	warndata_report.data_type = 1;
	warndata_report.alarm_type.time_stamp = rtc_counter_get();
	warndata_report.alarm_param.time_stamp = warndata_report.alarm_type.time_stamp;
}

static void rs485net_task(void *arg)
{
    uint32_t count = 0;
    uint32_t ltimestamp = 0, warn_ltimestamp = 0, alarm_ltimestamp = 0, left_ltimestamp = 0;
	uint32_t dhwarn_ltimestamp = 0, dhalarm_ltimestamp = 0;
    uint8_t index = 0;
    uint16_t retry = 0;
    unsigned char rdata[8] = {0};
    char display_buf[7];
    int key_status = 0;
	int adc_value[4] = {0};  //add by heyt 20240304
	
	
    memcpy(heartbeat_reportdata.heart_data.serial_number.value, "72-0066DF313436-3331", 21);
    ltimestamp = rtc_counter_get();
    while (1)
    {
        // get key status
        key_status = get_key_value();
//        printf("keybitmap:%02x\r\n", key_status);
        if ((key_status & 0x01) == 0)
        {	
			cancel_alarm();
			//add by heyt 20240306 start ----------------------
			clearwarn();
			clearalarm();
			warn_ltimestamp = 0;
			alarm_ltimestamp = 0;
			//add by heyt 20240306 end ------------------------
        }
        
        memset(rdata, 0x00, 8);

        heartbeat_reportdata.heart_data.serial_number.time_stamp = rtc_counter_get();
//        printf("timestamp: %d\r\n", heartbeat_reportdata.heart_data.serial_number.time_stamp);
        for (index = 0; index < 4; index++)
        {
            if ((count % deviceList[index].frequency) == 0)
            {
                while (usart_send(deviceList[index].bus, (uint8_t *)packed_modbus_rtu_frame(deviceList[index].address, 0x03, 0x0000, 0x0001), 8) < 0)
                {
//                    retry++;
//                    vTaskDelay(pdMS_TO_TICKS(10));
//                    if (retry > 100)
//                    {
//                        retry = 0;
//                        printf("usart_send retry over 100 times \r\n");
//                        break;
//                    }
                }

                // delay 1ms to make sure send finish
                vTaskDelay(pdMS_TO_TICKS(1));

                usart_recv_clear(deviceList[index].bus);
                while (usart_recv_pre(deviceList[index].bus, 7) < 0)
                {
                    retry++;
                    vTaskDelay(pdMS_TO_TICKS(10));
                    if (retry > 100)
                    {
                        retry = 0;
//                        printf("usart_recv_pre retry over 100 times \r\n");
                        break;
                    }
                }

                while (usart_recv(deviceList[index].bus, rdata) < 0)
                {
                    retry++;
                    vTaskDelay(pdMS_TO_TICKS(10));
                    if (retry > 100)
                    {
//                        printf("usart_recv %d retry over 100 times \r\n", index);
                        break;
                    }
                }
                if (retry > 100)
                {
                    retry = 0;
                }
                else
                {
                    if (parse_modbus_rtu_frame((ModbusRtuFrameAck *)rdata) == 0)
                    {
                        led_status |= 0x08;
                        led_process_cmd(0, &led_status,1);
//                        printf("slave_address:%02x, function_code:%02x, byte_count:%02x, ", ((ModbusRtuFrameAck *)rdata)->slave_address, ((ModbusRtuFrameAck *)rdata)->function_code, ((ModbusRtuFrameAck *)rdata)->byte_count);
//                        printf("data[0]:%02x, data[1]:%02x\r\n", ((ModbusRtuFrameAck *)rdata)->data[0], ((ModbusRtuFrameAck *)rdata)->data[1]);
						
                        switch (((ModbusRtuFrameAck *)rdata)->slave_address >> 6)
                        {
                        case 0x00: // smoker
                            sprintf(display_buf, "%02d.%02d", ((ModbusRtuFrameAck *)rdata)->data[0] % 100, ((ModbusRtuFrameAck *)rdata)->data[1] % 100);
                            // TODO:display smoker value
                            lcd_display(4, 5, display_buf);

                            // TODO: upload smoker sensor's value
                            heartbeat_reportdata.heart_data.smoke_detector.time_stamp = rtc_counter_get();
                            sprintf(heartbeat_reportdata.heart_data.smoke_detector.sensors[0].device_id, "%d", ((ModbusRtuFrameAck *)rdata)->slave_address);
                            heartbeat_reportdata.heart_data.smoke_detector.sensors[0].param = ((ModbusRtuFrameAck *)rdata)->data[0] * 100 + ((ModbusRtuFrameAck *)rdata)->data[1];

                            // TODO: compare with alram th
//                            printf("smoker value: %d\r\n", heartbeat_reportdata.heart_data.smoke_detector.sensors[0].param);
//							printf("smoke_threshold %d\r\n", p_configuration_data->smoke_threshold);
                            if ((key_status&0x01) && (heartbeat_reportdata.heart_data.smoke_detector.sensors[0].param > p_configuration_data->smoke_threshold))//2000))
                            {
//								printf("smoke alarm status = 1\r\n");
                                // 填充json数据
								if(! isalarmhappened()){
									set_alarm_data();
									sprintf(alarmdata_report.alarm_type.value, "%s", "SMOKE_ALARM");
									sprintf(alarmdata_report.alarm_param.value, "0.%d", heartbeat_reportdata.heart_data.smoke_detector.sensors[0].param / 100);
								}
                            }
                            break;
							
                        case 0x01: // gas
                            sprintf(display_buf, "%02d.%02d", ((ModbusRtuFrameAck *)rdata)->data[0] % 100, ((ModbusRtuFrameAck *)rdata)->data[1] % 100);
                            // TODO:display gas value
                            lcd_display(3, 5, display_buf);
                            // TODO: compare with alram th
                            // TODO: upload smoker sensor's value
                            heartbeat_reportdata.heart_data.gas_detector.time_stamp = rtc_counter_get();
                            sprintf(heartbeat_reportdata.heart_data.gas_detector.sensors[0].device_id, "%d", ((ModbusRtuFrameAck *)rdata)->slave_address);
                            heartbeat_reportdata.heart_data.gas_detector.sensors[0].param = ((ModbusRtuFrameAck *)rdata)->data[0] * 100 + ((ModbusRtuFrameAck *)rdata)->data[1];
//							printf("gas value %d\r\n",  heartbeat_reportdata.heart_data.gas_detector.sensors[0].param);
//							printf("gas_threshold %d\r\n", p_configuration_data->gas_threshold);
							if ((key_status&0x01) && (heartbeat_reportdata.heart_data.gas_detector.sensors[0].param > p_configuration_data->gas_threshold))//2000))
                            {
//								printf("gas alarm status = 1\r\n");
								// 填充json数据
								if(!isalarmhappened()){
									set_alarm_data();
									sprintf(alarmdata_report.alarm_type.value, "%s", "GAS_ALARM");
									sprintf(alarmdata_report.alarm_param.value, "0.%d", heartbeat_reportdata.heart_data.gas_detector.sensors[0].param / 100);
                                }
                            }
                            break;
							
                        case 0x02: // tempeture
                            heartbeat_reportdata.heart_data.temperature.sensors[0].param = ((ModbusRtuFrameAck *)rdata)->data[0] << 8 | ((ModbusRtuFrameAck *)rdata)->data[1];
                            
                            sprintf(display_buf, " %03d.%d", (heartbeat_reportdata.heart_data.temperature.sensors[0].param / 10) % 1000, heartbeat_reportdata.heart_data.temperature.sensors[0].param % 10);
                            // TODO:display tempeture value
                            lcd_display(2, 4, display_buf);

                            // TODO: upload tempeture sensor's value
                            heartbeat_reportdata.heart_data.temperature.time_stamp = rtc_counter_get();
                            sprintf(heartbeat_reportdata.heart_data.temperature.sensors[0].device_id, "%d", ((ModbusRtuFrameAck *)rdata)->slave_address);
                            // TODO: compare with alram th
//                        	printf("temperature  %d \r\n", heartbeat_reportdata.heart_data.temperature.sensors[0].param);
							// edit by heyt 20240305 start ------------
							//温度大于报警温度 不管有无人 报警
							if ((key_status&0x01) && ((heartbeat_reportdata.heart_data.temperature.sensors[0].param / 10) > (p_configuration_data->alarm_temp - p_configuration_data->temp_calibrate)))//200))
                            {
//								printf("tempeture alarm status = 1\r\n");
								//填充json数据
								if(!isalarmhappened()){
									if(iswarnhappened()){
										alarmdata_report.data_type = 1;
										alarmdata_report.alarm_type.time_stamp = warndata_report.alarm_type.time_stamp;
										clearwarn();
									}else{
										set_alarm_data();
									}
									sprintf(alarmdata_report.alarm_type.value, "%s", "DHLR_OIL_TEMP_HIGH");
									sprintf(alarmdata_report.alarm_param.value, "0.%d", heartbeat_reportdata.heart_data.temperature.sensors[0].param / 100);
                                }
                            }
							else if((key_status&0x01) && ((heartbeat_reportdata.heart_data.temperature.sensors[0].param / 10) > (p_configuration_data->warn_temp - p_configuration_data->temp_calibrate)))//100))
                            {
//								printf("tempeture warn status = 1\r\n");
								//填充json数据
								if(!iswarnhappened()){
									set_warn_data();
									sprintf(warndata_report.alarm_type.value, "%s", "OIL_TEMP_WARN");
									sprintf(warndata_report.alarm_param.value, "0.%d", heartbeat_reportdata.heart_data.temperature.sensors[0].param / 100);
                                }
                            }
							break;
							// edit by heyt 20240305 end ------------
                        case 0x03: // pir
                            // TODO:display pir value
                            if (((ModbusRtuFrameAck *)rdata)->data[1] == 1)
                            { // 有人，清空离人时间
                                heartbeat_reportdata.heart_data.body_detector.leave_time_stamp = 0;
                                heartbeat_reportdata.heart_data.body_detector.status = ((ModbusRtuFrameAck *)rdata)->data[1];
                                sprintf(display_buf, " 000");
                                lcd_display(1, 5, display_buf);
                            }
                            else
                            { // 没人，且上次也没人
                                if (heartbeat_reportdata.heart_data.body_detector.status == ((ModbusRtuFrameAck *)rdata)->data[1])
                                {
                                    heartbeat_reportdata.heart_data.body_detector.leave_time_stamp = heartbeat_reportdata.heart_data.body_detector.time_stamp - left_ltimestamp;
                                }
                                else // 没人，上次有人
                                {	
                                    // person left detected, save timestamp
                                    left_ltimestamp = rtc_counter_get();
                                }
  
