sunyongzhen/CHULIAN_GIT/GD32F30x_Demo_Suites_V2.4.3_release/GD32307C_EVAL_Demo_Suites/Project/25_CHULIAN_0312/Projects/FreeRTOS_tcpudp/src/app_rs485net.c
                                heartbeat_reportdata.heart_data.body_detector.status = ((ModbusRtuFrameAck *)rdata)->data[1];
                                heartbeat_reportdata.heart_data.body_detector.time_stamp = rtc_counter_get();
                            }
							// 显示时间
                            if ((heartbeat_reportdata.heart_data.body_detector.leave_time_stamp > 0) && (heartbeat_reportdata.heart_data.body_detector.leave_time_stamp < 1000))
                            {
                                sprintf(display_buf, " %03d", heartbeat_reportdata.heart_data.body_detector.leave_time_stamp);
                                lcd_display(1, 5, display_buf);
//								printf("left time %d\r\n", heartbeat_reportdata.heart_data.body_detector.leave_time_stamp);
//                                if ((key_status & 0x01) && (heartbeat_reportdata.heart_data.body_detector.leave_time_stamp > (p_configuration_data->warn_time + p_configuration_data->alarm_time)))
//                                {
//                                    audio_process_cmd(4, 0, 0);
//                                    led_status |= 0x20;
//                                    led_process_cmd(0, &led_status,0);
//                                }
                            }
                            // TODO: compare with alram th
                            // TODO: upload smoker sensor's value
                            break;
                        default:
                            break;
                        }

                    }
                }
//                printf("%02x %02x %02x %02x %02x %02x %02x %02x\r\n", rdata[0], rdata[1], rdata[2], rdata[3], rdata[4], rdata[5], rdata[6], rdata[7]);
            }
            vTaskDelay(pdMS_TO_TICKS(100));
        }
        count++;
		// TODO:ADC read
		// add by heyt 20240304 start---------------------------
		// 取adc 电流最大值
		adc_process_cmd(0, adc_value, 4);
		heartbeat_reportdata.heart_data.fire_sampler.code_data = 0;
		for(index = 0; index < 4; index++){
			if(adc_value[index] > heartbeat_reportdata.heart_data.fire_sampler.code_data){
				heartbeat_reportdata.heart_data.fire_sampler.code_data = adc_value[index];
			}
		}
//		heartbeat_reportdata.heart_data.fire_sampler.code_data = 100;   //---------------
//		alarm_action(0);
		// add by heyt 20240304 end-----------------------------
		
		// add by heyt 20240305 start ------------------
        /* 其他传感器：动火传感器、电池阀状态 */
        // TODO: 判断动火状态
		// 动火： 没按键、无人、温度超过预警温度或电流大于阈值 
		if((key_status & 0x01) && (heartbeat_reportdata.heart_data.body_detector.status == 0) && 
			((heartbeat_reportdata.heart_data.temperature.sensors[0].param / 10 > (p_configuration_data->alarm_temp - p_configuration_data->temp_calibrate))//200)
			|| (heartbeat_reportdata.heart_data.fire_sampler.code_data > p_configuration_data->hot_work_threshold)))//2000)))
		{
			//填充json数据
			if(heartbeat_reportdata.heart_data.fire_detector.status != 1){
				//报警状态
//				printf("dhlr warn status = 1\r\n");
				heartbeat_reportdata.heart_data.fire_detector.status = 1;
				
				if(iswarnhappened()){  //预警时发现报警，将状态改为报警
					alarmdata_report.data_type = 1;
					alarmdata_report.alarm_type.time_stamp = warndata_report.alarm_type.time_stamp;
					clearwarn();
				}else{
					set_alarm_data();
				}
				sprintf(alarmdata_report.alarm_type.value, "%s", "DHLR_ALARM");
				
				if(heartbeat_reportdata.heart_data.temperature.sensors[0].param / 10 > (p_configuration_data->alarm_temp - p_configuration_data->temp_calibrate))//200)
				{
					sprintf(alarmdata_report.alarm_param.value, "0.%d", heartbeat_reportdata.heart_data.temperature.sensors[0].param / 100);
				}
				else if(heartbeat_reportdata.heart_data.fire_sampler.code_data > p_configuration_data->hot_work_threshold)//2000)
				{
					sprintf(alarmdata_report.alarm_param.value, "0.%d", heartbeat_reportdata.heart_data.fire_sampler.code_data);
				}
			}
		}
		else if((key_status & 0x01) && (heartbeat_reportdata.heart_data.body_detector.status == 0) && 
			((heartbeat_reportdata.heart_data.temperature.sensors[0].param / 10 > (p_configuration_data->warn_temp - p_configuration_data->temp_calibrate))//100)
			|| (heartbeat_reportdata.heart_data.fire_sampler.code_data > p_configuration_data->hot_work_threshold)))//2000)))
		{
			//填充json数据
			if(heartbeat_reportdata.heart_data.fire_detector.status == 0){
				//预警状态
//				printf("dhlr warn status = 2\r\n");
				heartbeat_reportdata.heart_data.fire_detector.status = 2;
				set_warn_data();
				sprintf(warndata_report.alarm_type.value, "%s", "DHLR_WARN");
				if(heartbeat_reportdata.heart_data.temperature.sensors[0].param / 10 > (p_configuration_data->warn_temp - p_configuration_data->temp_calibrate))//100)
				{
					sprintf(warndata_report.alarm_param.value, "0.%d", heartbeat_reportdata.heart_data.temperature.sensors[0].param / 100);
				}
				else if(heartbeat_reportdata.heart_data.fire_sampler.code_data > p_configuration_data->hot_work_threshold)//2000)
				{
					sprintf(warndata_report.alarm_param.value, "0.%d", heartbeat_reportdata.heart_data.fire_sampler.code_data);
				}
			}
		}
		else{
			heartbeat_reportdata.heart_data.fire_detector.status = 0;
			dhwarn_ltimestamp = 0;
			dhalarm_ltimestamp = 0;
			if(!iswarnhappened() && !isalarmhappened()){
				cancel_alarm();
			}
		}
		//动火
		if(heartbeat_reportdata.heart_data.fire_detector.status != 0)
		{
			heartbeat_reportdata.heart_data.fire_detector.time_stamp = rtc_counter_get();
			// 动火 预警
			if(heartbeat_reportdata.heart_data.fire_detector.status == 2){
				//动火后 时间大于预警延迟 且 没有预警动作
				if(((heartbeat_reportdata.heart_data.fire_detector.time_stamp - warndata_report.alarm_param.time_stamp) > p_configuration_data->warn_delay)//5)
					&& dhwarn_ltimestamp == 0)
				{
//					printf("dhlr warn action start \r\n");
					alarm_action(0);
					dhwarn_ltimestamp = rtc_counter_get(); // 开始动火离人预警计时
				}
				//预警时间大于时长
				if(dhwarn_ltimestamp != 0 && dhalarm_ltimestamp == 0 &&
					((heartbeat_reportdata.heart_data.fire_detector.time_stamp - dhwarn_ltimestamp) > p_configuration_data->warn_time))//5))
				{
//					printf("cancel dhlr warn action \r\n");
					//取消预警
					cancel_alarm();
				}
				//预警时间大于报警延迟
				if(dhwarn_ltimestamp != 0 && dhalarm_ltimestamp == 0 &&
					((heartbeat_reportdata.heart_data.fire_detector.time_stamp - dhwarn_ltimestamp) > p_configuration_data->alarm_delay))//10))
				{
//					printf("dhlr alarm action 1 start \r\n");
					alarm_action(1);
					dhalarm_ltimestamp = rtc_counter_get(); // 开始动火离人报警计时
					heartbeat_reportdata.heart_data.fire_detector.status = 1;
				}
			}
			
			else if(heartbeat_reportdata.heart_data.fire_detector.status == 1){
				if(dhalarm_ltimestamp == 0 && 
					((heartbeat_reportdata.heart_data.fire_detector.time_stamp - alarmdata_report.alarm_param.time_stamp) > p_configuration_data->alarm_delay))//10))
				{
//					printf("dhlr alarm action 2 start \r\n");
					alarm_action(1);
					dhalarm_ltimestamp = rtc_counter_get(); // 开始动火离人报警计时
				}
				
				//报警时间大于报警时长
				if(dhalarm_ltimestamp != 0 && 
					((heartbeat_reportdata.heart_data.fire_detector.time_stamp - dhalarm_ltimestamp) > p_configuration_data->alarm_time))//10))
				{
					 //取消报警
//					printf("cancel dhlr alarm action \r\n");
					cancel_alarm();
					
					//断电断气
					key_process_cmd(0, 0, 0);

					heartbeat_reportdata.heart_data.fire_detector.status = 0;
					heartbeat_reportdata.heart_data.fire_detector.time_stamp = 0;
					clearalarm();
					clearwarn();
					dhwarn_ltimestamp = 0;
					dhalarm_ltimestamp = 0;
				}
			}
		}
		
