sunyongzhen/CHULIAN_GIT/GD32F30x_Demo_Suites_V2.4.3_release/GD32307C_EVAL_Demo_Suites/Project/25_CHULIAN_0312/Projects/FreeRTOS_tcpudp/src/app_rs485net.c
		//add by heyt 20240306 start ----------------------
		else//没有动火
		{	//温度预警状态
			if((key_status & 0x01) && iswarnhappened() && !isalarmhappened())
			{
				if((heartbeat_reportdata.heart_data.temperature.sensors[0].param / 10) < (p_configuration_data->warn_temp - p_configuration_data->temp_calibrate))//100)
				{
//					printf("temp electricity < threshold  cancel warn \r\n");
					clearwarn();
					cancel_alarm();
				}
				
				ltimestamp = rtc_counter_get();
				//没有预警行为 且 时间大于预警延迟
				if(warn_ltimestamp == 0 && ((ltimestamp - warndata_report.alarm_param.time_stamp) > p_configuration_data->warn_delay))//5))
				{
//					printf("do warn action \r\n");
					alarm_action(2);
					warn_ltimestamp = rtc_counter_get();
				}
				//预警时间大于预警时长
				if(warn_ltimestamp != 0 && ((ltimestamp - warn_ltimestamp) > p_configuration_data->warn_time))//5))
				{
//					printf("cancel warn action \r\n");
					//取消预警
					cancel_alarm();
					
				}
				//时间大于报警延迟
				if(warn_ltimestamp != 0 && ((ltimestamp - warn_ltimestamp) > p_configuration_data->alarm_delay))//10))
				{
					//报警
//					printf("dhlr alarm action \r\n");
					//填充json数据
					set_alarm_data();
					sprintf(alarmdata_report.alarm_type.value, "%s", "DHLR_OIL_TEMP_HIGH");
					sprintf(alarmdata_report.alarm_param.value, "0.%d", heartbeat_reportdata.heart_data.fire_detector.status);
					
					alarm_action(3);
					warn_ltimestamp = 0;
					alarm_ltimestamp = rtc_counter_get();
				}
			}
			
			//燃气 烟雾 温度报警状态
			if((key_status & 0x01) && isalarmhappened() )
			{
				if((heartbeat_reportdata.heart_data.smoke_detector.sensors[0].param < p_configuration_data->gas_threshold ) && //2000) &&
					(heartbeat_reportdata.heart_data.gas_detector.sensors[0].param < p_configuration_data->smoke_threshold) && //2000) && // 
					((heartbeat_reportdata.heart_data.temperature.sensors[0].param / 10) < (p_configuration_data->warn_temp - p_configuration_data->temp_calibrate)))//100)) //
				{
//					printf("temp gas smoke < threshold  cancel warn \r\n");
					clearalarm();	
					cancel_alarm();
				}
				
				ltimestamp = rtc_counter_get();
				//没有报警行为 时间大于报警延迟
				if(alarm_ltimestamp == 0 && ((ltimestamp - alarmdata_report.alarm_param.time_stamp) > p_configuration_data->alarm_delay))//10))
				{
					int temp = 0;
//					printf("do alarm action \r\n");
					if(strcmp(alarmdata_report.alarm_type.value, "DHLR_OIL_TEMP_HIGH") == 0){
						temp = 3;
					}else if(strcmp(alarmdata_report.alarm_type.value, "GAS_ALARM") == 0){
						temp = 4;
					}else if(strcmp(alarmdata_report.alarm_type.value, "SMOKE_ALARM") == 0){
						temp = 5;
					}
					alarm_action(temp);
					
					alarm_ltimestamp = rtc_counter_get();
				}
				
				//时间大于报警时长
				if(alarm_ltimestamp!=0 && ((ltimestamp - alarm_ltimestamp) > p_configuration_data->alarm_time))//10))
				{   //取消报警
//					printf("cancel alarm action \r\n");
					cancel_alarm();
					
					//断电断气
					key_process_cmd(0, 0, 0);
					alarmdata_report.alarm_param.time_stamp = 0;
					clearalarm();
					alarm_ltimestamp = 0;
					warndata_report.alarm_param.time_stamp = 0;
					clearwarn();
					warn_ltimestamp = 0;
				}
			}
		}
		vTaskDelay(pdMS_TO_TICKS(100));
		//add by heyt 20240306 end ----------------------
		
//        // TODO: 电池阀状态 相关应用
//        heartbeat_reportdata.heart_data.power_valves.time_stamp = rtc_counter_get();
//        heartbeat_reportdata.heart_data.power_valves.status = 0;

//        // TODO: 动火传感器码值处理
//        heartbeat_reportdata.heart_data.fire_sampler.time_stamp = rtc_counter_get();
//        heartbeat_reportdata.heart_data.fire_sampler.code_data = 800;

    }

}

void rs485net_task_init(void)
{
    deviceList[0].bus = EVAL_COM4;
    deviceList[0].address = 0x0041;
    deviceList[0].frequency = 0x01;
    deviceList[1].bus = EVAL_COM4;
    deviceList[1].address = 0x00c3;
    deviceList[1].frequency = 0x01;
    deviceList[2].bus = EVAL_COM4;
    deviceList[2].address = 0x0000;
    deviceList[2].frequency = 0x01;
    deviceList[3].bus = EVAL_COM4;
    deviceList[3].address = 0x0082;
    deviceList[3].frequency = 0x01;
    xTaskCreate(rs485net_task, "RS485NET", DEFAULT_THREAD_STACKSIZE * 4, NULL, RS485NET_TASK_PRIO, NULL);
}
